Repository: samlach2222/BrodUI
Catalog: BrodUI/Assets/Languages/Resource.*.resx
Languages: fr

# Settings_LabelAbout
source: About BrodUI
fr: À propos de BrodUI

# Settings_LabelTheme
source: Theme
fr: Thème

# Settings_LabelLanguage
source: Language
fr: Langage

# Settings_VersionNumber
source: Version 1.0
fr: Version 0.1

# Settings_LabelGitHubLinks
source: Links
fr: Liens

# Settings_LinkProjectWebsiteOnGitHub
source: Project website on GitHub
fr: Le site web du projet sur GitHub

# Settings_LinkLatestReleaseOnGithub
source: Latest release on GitHub
fr: La dernière version sur GitHub

# Settings_LabelThirdPartyLibraries
source: Third party libraries
fr: Bibliothèques tierces

# Convert_LabelButtonConvert
source: Convert Image
fr: Convertir l'image

# Convert_LabelImageHeight
source: Height
fr: Hauteur

# Convert_LabelImageWidth
source: Width
fr: Largeur

# Convert_LabelButtonDeleteImage
source: Delete Image
fr: Supprimer l'image

# Convert_LabelButtonLoadImage
source: Load Image file
fr: Charger une image

# PageName_Settings
source: Settings
fr: Paramètres

# PageName_Export
source: Export
fr: Exporter

# PageName_Convert
source: Convert
fr: Convertir

# PageName_Tutorial
source: Tutorial
fr: Tutoriel

# Terminal_To
source: to
fr: en

# Terminal_ThemeChanged
source: Settings -> The theme has been changed from
fr: Paramètres -> Le thème a été changé de

# Terminal_LanguageChanged
source: Settings -> The language has been changed from
fr: Paramètres -> Le langage a été changé de

# Terminal_TerminalChanged
source: Settings -> The terminal has been changed from
fr: Paramètres -> La présence du terminal a été changée de

# Terminal_SettingsPage
source: SETTINGS PAGE
fr: PAGE DES PARAMETRES

# Terminal_ImageLinkChanged
source: Convert -> The image link has been changed from
fr: Convertir -> Le lien de l'image a été changé de

# Terminal_WidthChanged
source: Convert -> The width of the image changed from
fr: Convertir -> La largeur de l'image a été changée de

# Terminal_HeightChanged
source: Convert -> The height of the image changed from
fr: Convertir -> La hauteur de l'image a été changée de

# Terminal_ImageSaveIn
source: has been saved in
fr: a été sauvegardée dans

# Terminal_ImageWidthAndHeight
source: The image with the following Width and Height
fr: L'image qui a la largeur et la hauteur suivante

# Terminal_ImageConvertedOk
source: The image has been converted
fr: L'image a été convertie

# Terminal_ConvertPage
source: CONVERT PAGE
fr: PAGE DE CONVERTION

# Terminal_TutorialPage
source: TUTORIAL PAGE
fr: PAGE DE TUTORIEL

# Terminal_ExportPage
source: EXPORT PAGE
fr: PAGE D'EXPORT

# Terminal_ImportLog
source: START IMPORTING OLD LOGS...
fr: DEBUT DE L'IMPORTATION DES ANCIENS LOGS...

# Terminal_ImportLogOk
source: OLD LOGS IMPORT DONE !
fr: L'IMPORTATION DES ANCIENS LOGS EST FINIE !

# Export_NoImageMessage
source: No converted image found, please convert an image first
fr: Aucune image convertie n'a été trouvée, merci de convertir une image avant

# Export_ColorLabel
source: Color
fr: Couleur

# Export_NumberLabel
source: Number
fr: Nombre

# Export_NameLabel
source: Name
fr: Nom

# Export_LengthLabel
source: Length (cm)
fr: Longueur (cm)

# Export_ExportToPdfButton
source: Export to PDF
fr: Exporter en PDF

# Export_ConvertToCrossStitchEmbroidery
source: Converting the image to cross-stitch embroidery...
fr: Conversion de l'image en broderie au point de croix...

# Export_ConvertToCrossStitchEmbroideryDone
source: Conversion done
fr: Conversion terminé

# Settings_LabelDeleteLogs
source: Delete logs
fr: Supprimer les logs

# Settings_LabelResetSettings
source: Reset settings
fr: Réinitialiser les paramètres

# Convert_MinimumHeight
source: Height must be greater than
fr: La hauteur doit être supérieur à

# Convert_MinimumHeight_WithValue
source: Height will be {0}, but height must be greater than
fr: La hauteur sera {0}, mais la hauteur doit être supérieur à

# Convert_MinimumWidth
source: Width must be greater than
fr: La largeur doit être supérieur à

# Convert_MinimumWidth_WithValue
source: Width will be {0}, but width must be greater than
fr: La largeur sera {0}, mais la largeur doit être supérieur à

# ImageManagement_InvalidImageFile
source: Invalid image file
fr: Fichier image non valide

# Settings_LabelEmbroiderySize
source: Embroidery point Size
fr: Taille d'un point de broderie

# Settings_LinkOriginalIcon
source: Logo edited from a cross-stitch icon created by Freepik - Flaticon
fr: Logo modifié depuis une icône de point de croix créé par Freepik - Flaticon

# Convert_LabelNbColors
source: Colors
fr: Couleurs

# Convert_LabelNbIteration
source: Iterations
fr: Itérations

# ConvertLabelModel
source: Model
fr: Modèle

# Tutorial_Title1Text
source: Welcome in BrodUI:
fr: Bienvenue dans BrodUI :

# Tutorial_Part1Text
source: This application aims to offer to embroiderers, to generate an embroidery pattern from an image, then to export it in PDF.
fr: Cette application a pour but de proposer à des brodeuses et brodeurs, de générer un patron de broderie à partir d’une image, puis de pouvoir l’exporter en PDF.

# Tutorial_Part2Text
source: For this, BrodUI uses the K-Means algorithm. This one allows to reduce efficiently the number of colors of your image to avoid having hundreds of different thread colors.
fr: Pour cela, BrodUI utilise l’algorithme K-Means. Celui-ci permet de réduire efficacement le nombre de couleur de votre image pour ainsi ne pas avoir des centaines de couleurs de fils différentes.

# Tutorial_Title2Text
source: How to use BrodUI:
fr: Comment utiliser BrodUI :

# Tutorial_Part3aText
source: To begin, click on
fr: Pour commencer, cliquez sur

# Tutorial_Part3cText
source: in the sidebar. You will then be able to choose your image, its dimensions, the number of thread colors you want and the number of iterations of the algorithm (the more iterations, the longer the process takes, but the more accurate it is). Then finally you can convert your image.
fr: dans la barre latérale. Vous pourrez alors choisir votre image, ses dimensions, le nombre de couleurs de fil souhaité ainsi que le nombre d’itération de l’algorithme (plus il y en as, plus le procédé prends de temps, mais plus il est précis). Puis enfin vous pourrez convertir votre image.

# Tutorial_Part4aText
source: The export page is now in front of you. You can see the transformed image, the list of threads and their quantities and the associated embroidery pattern. With a simple click on the
fr: La page d’export est maintenant devant vous. Vous pouvez ainsi voir l’image transformée, la liste des fils ainsi que leurs quantités et le patron de broderie associé. D’un simple clic sur le bouton

# Tutorial_Part4cText
source: button, you will be able to obtain a PDF file with your embroidery pattern.
fr: vous pourrez alors obtenir un fichier PDF avec votre patron de broderie.

# Tutorial_Part5aText
source: If the size of your pattern is too small, then you can change in the
fr: Si la taille de votre patron est trop petite, vous pouvez alors changer dans les

# Tutorial_Part5cText
source: If the size of your pattern is too small, then you can change in the "Settings", the size of an embroidery stitch. In this page you can also change the language and theme of the application, get additional information using the terminal or visit the GitHub page of the project.
fr: la taille d’un point de broderie. Dans cette page vous pouvez également changer la langue et le thème de l’application, obtenir des informations supplémentaires à l’aide du terminal ou visiter la page GitHub du projet.

# Tutorial_BeginButtonLabel
source: Let's go!
fr: C'est parti !

# Convert_ToolTipLoadImage
source: Load an image from your PC to convert it
fr: Charger une image depuis votre PC pour la convertir

# Convert_ToolTipRemoveImage
source: Delete the currently loaded image
fr: Supprimer l'image actuellement chargée

# Convert_ToolTipImageWidth
source: Change the width of the loaded image
fr: Changer la largeur de l'image chargée

# Convert_ToolTipImageHeight
source: Change the height of the loaded image
fr: Changer la hauteur de l'image chargée

# Convert_ToolTipNbColor
source: Choose the number of colors of the converted image
fr: Choisir le nombre de couleurs de l'image convertie

# Convert_ToolTipNbIterations
source: Choose the number of iterations of the algorithm (the higher the value, the longer but more accurate)
fr: Choisir le nombre d'itérations de l'algorithme (plus la valeur est élevée, plus c'est long, mais précis)

# Convert_ToolTipModel
source: Choose the color scheme (results may differ)
fr: Choisir le modèle de couleur (les résultats peuvent différer)

# Convert_ToolTipConvertButton
source: Convert the currently loaded image
fr: Convertir l'image actuellement chargée

# Export_ToolTipConvertButton
source: Convert the pattern to PDF (the name of the document will be the name of the pattern)
fr: Convertir le patron en PDF (le nom du document sera le nom du patron)

# Terminal_InTime
source: in
fr: en

# Convert_BigEmbroideryWarning
source: Converting to a big embroidery size can take a lot of time, are you sure you want to continue ?
fr: La conversion vers une grande taille de broderie peut prendre beaucoup de temps, êtes-vous sûr de vouloir continuer ?

# Terminal_Cancel
source: Cancel
fr: Annuler
